# HasFirstProfilePoint Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RuledSurface..::..HasFirstProfilePoint Method
RuledSurface Class See Also
---
Checks if a point was used to define the first profile.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool HasFirstProfilePoint()
```

Visual Basic
---
```text
Public Function HasFirstProfilePoint As Boolean
```

Visual C++
---
```text
public:
bool HasFirstProfilePoint()
```

# ### Return Value
True if a point was used to define the first profile, false otherwise.
# See Also
RuledSurface Class
Autodesk.Revit.DB Namespace